Repository: mariusjcb/heimdall-weather
Catalog: Heimdall/*.lproj/Localizable.strings
Languages: ro_ro

source: Unknown Error
ro_ro: eroare necunoscuta

source: Unknown Message
ro_ro: Mesaj necunoscut

source: API URL is nil
ro_ro: URL-ul este nul

source: Path has no dynamic variable named
ro_ro: Calea nu contine variabila dinamica

source: Invalid path:
ro_ro: Path Invalid:

source: Invalid URL:
ro_ro: URL Invalid:

source: Failed requesting RestAPI
ro_ro: Trimiterea cererii catre API a esuat

source: JSON Key doesn't exist
ro_ro: Cheia json nu exista

source: JSON Key doesn't exist or can't be converted into dictionary object
ro_ro: Cheia json nu exista sau valoarea ei nu poate fi convertita in dictionar

source: JSON Key value can't be converted into dictionary object
ro_ro: Valoarea cheii nu poate fi convertita in dictionar

source: Data object can't be represented as utf8
ro_ro: Obiectul data nu poate fi reprezentat ca UTF8

source: Value can't be converted into Array object
ro_ro: Valoarea nu poate fi convertita in Array

source: Data exists but JSON can't be deserialized
ro_ro: Exista obiectul data dar nu pot deserializa JSON-ul

source: Data is nil
ro_ro: Obiectul data este nul

source: Empty path
ro_ro: Cale goala

source: Is not a required endpoint by completion handler
ro_ro: Nu este un endpoint cerut de completion handler

source: Wrong RestAPI response
ro_ro: Raspuns eronat de la API

source: Main JSON
ro_ro: JSON Principal

source: URL called:
ro_ro: URL apelat:

source: Missing
ro_ro: Lipseste

source: Couldn't write file
ro_ro: Nu pot scrie fisierul

source: Data processing need a handler
ro_ro: Procesarea datelor are nevoie de un handler

source: Forecast Update: Location not found in WeatherDataManager
ro_ro: Forecast Update: Locatie negasita in WeatherDataManager

source: Runtime Exception
ro_ro: Exceptie de runtime

source: Requested location not exist into WeatherDataManager, call condition API first.
ro_ro: Locatia cautata nu a fost creata anterior. Apelati conditions API mai intai.

source: Time from last all weather data update is too soon
ro_ro: A trecut prea putin timp de la ultimul update a vremii

source: Today
ro_ro: Astazi

source: Tomorrow
ro_ro: Maine
